Revit 2026 API

# KeyBasedTreeEntriesFindEntry Method

---

Finds the KeyBasedTreeEntry associated with the given key value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public KeyBasedTreeEntry FindEntry(
	string key
)
```
```vb
Public Function FindEntry (
	key As String
) As KeyBasedTreeEntry
```
```cpp
public:
KeyBasedTreeEntry^ FindEntry(
	String^ key
)
```
```fsharp
member FindEntry :
        key : string -> KeyBasedTreeEntry
```

#### Parameters

key String
     The specified key value.

#### Return Value

KeyBasedTreeEntry The KeyBasedTreeEntry corresponds to the given key value.

| Exception | Condition |
| --- | --- |
| ArgumentException | key is an empty string. |
| ArgumentNullException | A non-optional argument was null |

If no matching KeyBasedTreeEntry can be found, null will be returned; The given key value cannot be an empty string.

#### Reference

KeyBasedTreeEntries Class

Autodesk.Revit.DB Namespace